app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "amag"], ["created_at", "2020-07-16 18:14:36.876265"], ["updated_at", "2020-07-16 18:14:36.876265"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save